{
  "version": "1.0",
  "truncation": {"max_length": 128, "strategy": "longest_first", "stride": 0, "direction": "right"},
  "padding": {"strategy": "batch_longest", "direction": "right", "pad_id": 0, "pad_type_id": 0, "pad_token": "<pad>"},
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {"type": "NFKC"},
      {"type": "Lowercase"}
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true
  },
  "decoder": {
    "type": "ByteLevel"
  },
  "model": {
    "type": "BPE",
    "unk_token": "<unk>",
    "byte_fallback": true,
    "fuse_unk": false,
    "dropout": null,
    "end_of_word_suffix": "</w>",
    "vocab": {
      "<unk>": 0,
      "</w>": 1,
      "h": 2,
      "e": 3,
      "l": 4,
      "o": 5,
      "w": 6,
      "r": 7,
      "d": 8,
      "he": 9,
      "hel": 10,
      "hell": 11,
      "hello": 12,
      "hello</w>": 13,
      "wo": 14,
      "wor": 15,
      "worl": 16,
      "world": 17,
      "world</w>": 18
    },
    "merges": [
      "h e",
      "he l",
      "hel l",
      "hell o",
      "hello </w>",
      "w o",
      "wo r",
      "wor l",
      "worl d",
      "world </w>"
    ]
  },
  "added_tokens": []
}
