{
  "version": "1.0",
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {"type": "NFKC"},
      {"type": "Lowercase"},
      {"type": "StripAccents"}
    ]
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "add_prefix_space": true
  },
  "decoder": {
    "type": "Sequence",
    "decoders": [
      {"type": "Metaspace", "replacement": "▁"}
    ]
  },
  "model": {
    "type": "Unigram",
    "unk_id": 0,
    "byte_fallback": false,
    "vocab": [
      ["<unk>", -99.0],
      ["▁hello", -0.1],
      ["▁world", -0.1],
      ["▁", -2.0],
      ["h", -5.0],
      ["e", -5.0],
      ["l", -5.0],
      ["o", -5.0],
      ["w", -5.0],
      ["r", -5.0],
      ["d", -5.0]
    ]
  },
  "added_tokens": []
}
